In [1]:
import saspy
sas = saspy.SASsession()

Using SAS Config named: oda
SAS Connection established. Subprocess id is 22500

### prdsale

In [ ]:
sd = sas.sasdata("prdsale","sashelp")
sd.head()

,ACTUAL,PREDICT,COUNTRY,REGION,DIVISION,PRODTYPE,PRODUCT,QUARTER,YEAR,MONTH
0,925.0,850.0,CANADA,EAST,EDUCATION,FURNITURE,SOFA,1.0,1993.0,1993-01-01
1,999.0,297.0,CANADA,EAST,EDUCATION,FURNITURE,SOFA,1.0,1993.0,1993-02-01
2,608.0,846.0,CANADA,EAST,EDUCATION,FURNITURE,SOFA,1.0,1993.0,1993-03-01
3,642.0,533.0,CANADA,EAST,EDUCATION,FURNITURE,SOFA,2.0,1993.0,1993-04-01
4,656.0,646.0,CANADA,EAST,EDUCATION,FURNITURE,SOFA,2.0,1993.0,1993-05-01

In [ ]:
sas.submit(f"""
    proc freq data=sashelp.prdsale noprint;
        tables country * region / out=_tmp;
    run;
""")
df = sas.sasdata("_tmp","work").to_df()
df

   COUNTRY REGION  COUNT    PERCENT
0   CANADA   EAST  240.0  16.666667
1   CANADA   WEST  240.0  16.666667
2  GERMANY   EAST  240.0  16.666667
3  GERMANY   WEST  240.0  16.666667
4   U.S.A.   EAST  240.0  16.666667
5   U.S.A.   WEST  240.0  16.666667

In [ ]:
sd.top("division")

    DIVISION  COUNT  PERCENT
0   CONSUMER  720.0     50.0
1  EDUCATION  720.0     50.0

In [ ]:
sd.top("prodtype")

    PRODTYPE  COUNT  PERCENT
0     OFFICE  864.0     60.0
1  FURNITURE  576.0     40.0

In [ ]:
sd.top("product")

  PRODUCT  COUNT  PERCENT
0     BED  288.0     20.0
1   CHAIR  288.0     20.0
2    DESK  288.0     20.0
3    SOFA  288.0     20.0
4   TABLE  288.0     20.0

##